; domain
; IPC5 Domain: Trucks Propositional
; Authors: Yannis Dimopoulos, Alfonso Gerevini and Alessandro Saetti 

(define (domain Trucks) 
(:requirements :typing :adl)  

(:types truckarea time location locatable - object
        truck package - locatable) 

(:predicates (at ?x - locatable ?l - location) 	     
             (in ?p - package ?t - truck ?a - truckarea) 	     
             (connected ?x ?y - location)
             (free ?a - truckarea ?t - truck)
  	     (time-now ?t - time)
 	     (next ?t1 - time ?t2 - time)
	     (le ?t1 - time ?t2 - time)
 	     (delivered ?p - package ?l - location ?t - time)
	     (at-destination ?p - package ?l - location)
 	     (closer ?a1 - truckarea ?a2 - truckarea))

(:action load
 :parameters (?p - package ?t - truck ?a1 - truckarea ?l - location)
 :precondition (and (at ?t ?l) (at ?p ?l) (free ?a1 ?t)
  		    (forall (?a2 - truckarea)
  			    (imply (closer ?a2 ?a1) (free ?a2 ?t))))
 :effect (and (not (at ?p ?l)) (not (free ?a1 ?t)) (in ?p ?t ?a1)))

(:action unload
 :parameters (?p - package ?t - truck ?a1 - truckarea ?l - location)
 :precondition (and (at ?t ?l) (in ?p ?t ?a1)
  		    (forall (?a2 - truckarea)
  			    (imply (closer ?a2 ?a1) (free ?a2 ?t))))
 :effect (and (not (in ?p ?t ?a1)) (free ?a1 ?t) (at ?p ?l)))

(:action drive
 :parameters (?t - truck ?from ?to - location ?t1 ?t2 - time)
 :precondition (and (at ?t ?from) (connected ?from ?to) 
		    (time-now ?t1) (next ?t1 ?t2))
 :effect (and (not (at ?t ?from)) (not (time-now ?t1)) 
	      (time-now ?t2) (at ?t ?to)))

(:action deliver
 :parameters (?p - package ?l - location ?t1 ?t2 - time)
 :precondition (and (at ?p ?l) (time-now ?t1) (le ?t1 ?t2))
 :effect (and (not (at ?p ?l)) (delivered ?p ?l ?t2) (at-destination ?p ?l)))

)

; problem
; Domain designed by Yannis Dimopoulos, Alfonso Gerevini and Alessandro Saetti
; This file has been automatically generated by the generator available from
; http://zeus.ing.unibs.it/ipc-5/generators/index.html

(define (problem truck-761)
(:domain Trucks)
(:objects
	truck1 - truck
	truck2 - truck
	package1 - package
	package2 - package
	package3 - package
	l1 - location
	l2 - location
	l3 - location
	l4 - location
	l5 - location
	l6 - location
	t0 - time
	t1 - time
	t2 - time
	t3 - time
	t4 - time
	t5 - time
	t6 - time
	a1 - truckarea
	a2 - truckarea
	a3 - truckarea
	a4 - truckarea)

(:init
	(at truck1 l6)
	(at truck2 l3)
	(free a1 truck1)
	(free a2 truck1)
	(free a3 truck1)
	(free a4 truck1)
	(free a1 truck2)
	(free a2 truck2)
	(free a3 truck2)
	(free a4 truck2)
	(closer a1 a2)
	(closer a1 a3)
	(closer a1 a4)
	(closer a2 a3)
	(closer a2 a4)
	(closer a3 a4)
	(at package1 l6)
	(at package2 l6)
	(at package3 l6)
	(connected l1 l2)
	(connected l1 l3)
	(connected l1 l4)
	(connected l1 l5)
	(connected l1 l6)
	(connected l2 l1)
	(connected l2 l3)
	(connected l2 l4)
	(connected l2 l5)
	(connected l2 l6)
	(connected l3 l1)
	(connected l3 l2)
	(connected l3 l4)
	(connected l3 l5)
	(connected l3 l6)
	(connected l4 l1)
	(connected l4 l2)
	(connected l4 l3)
	(connected l4 l5)
	(connected l4 l6)
	(connected l5 l1)
	(connected l5 l2)
	(connected l5 l3)
	(connected l5 l4)
	(connected l5 l6)
	(connected l6 l1)
	(connected l6 l2)
	(connected l6 l3)
	(connected l6 l4)
	(connected l6 l5)
	(time-now t0)
	(le t1 t1)
	(le t1 t2)
	(le t1 t3)
	(le t1 t4)
	(le t1 t5)
	(le t1 t6)
	(le t2 t2)
	(le t2 t3)
	(le t2 t4)
	(le t2 t5)
	(le t2 t6)
	(le t3 t3)
	(le t3 t4)
	(le t3 t5)
	(le t3 t6)
	(le t4 t4)
	(le t4 t5)
	(le t4 t6)
	(le t5 t5)
	(le t5 t6)
	(le t6 t6)
	(next t0 t1)
	(next t1 t2)
	(next t2 t3)
	(next t3 t4)
	(next t4 t5)
	(next t5 t6))

(:goal (and 
	(delivered package1 l2 t5)
	(delivered package2 l4 t5)
	(delivered package3 l1 t5)))



)

; plan
1. (load package1 truck1 a1 l6)
   deleted: (at package1 l6) (free a1 truck1)
   added: (in package1 truck1 a1)
   goals met: 0 of 3
2. (drive truck2 l3 l6 t0 t1)
   deleted: (at truck2 l3) (time-now t0)
   added: (time-now t1) (at truck2 l6)
   goals met: 0 of 3
3. (drive truck1 l6 l2 t1 t2)
   deleted: (at truck1 l6) (time-now t1)
   added: (time-now t2) (at truck1 l2)
   goals met: 0 of 3
4. (load package2 truck2 a2 l6)
   deleted: (at package2 l6) (free a2 truck2)
   added: (in package2 truck2 a2)
   goals met: 0 of 3
5. (unload package1 truck1 a1 l2)
   deleted: (in package1 truck1 a1)
   added: (free a1 truck1) (at package1 l2)
   goals met: 0 of 3
6. (load package3 truck2 a1 l6)
   deleted: (at package3 l6) (free a1 truck2)
   added: (in package3 truck2 a1)
   goals met: 0 of 3
7. (deliver package1 l2 t2 t5)
   deleted: (at package1 l2)
   added: (delivered package1 l2 t5) (at-destination package1 l2)
   goals met: 1 of 3
8. (drive truck2 l6 l1 t2 t3)
   deleted: (at truck2 l6) (time-now t2)
   added: (time-now t3) (at truck2 l1)
   goals met: 1 of 3
9. (unload package3 truck2 a1 l1)
   deleted: (in package3 truck2 a1)
   added: (free a1 truck2) (at package3 l1)
   goals met: 1 of 3
10. (drive truck2 l1 l4 t3 t4)
   deleted: (at truck2 l1) (time-now t3)
   added: (time-now t4) (at truck2 l4)
   goals met: 1 of 3
11. (deliver package3 l1 t4 t5)
   deleted: (at package3 l1)
   added: (delivered package3 l1 t5) (at-destination package3 l1)
   goals met: 2 of 3
12. (unload package2 truck2 a2 l4)
   deleted: (in package2 truck2 a2)
   added: (free a2 truck2) (at package2 l4)
   goals met: 2 of 3
13. (deliver package2 l4 t4 t5)
   deleted: (at package2 l4)
   added: (delivered package2 l4 t5) (at-destination package2 l4)
   goals met: 3 of 3
